--------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\geron\Documents\GitHub\Applied_Econometrics\PS1\output/tp1-2022-08-19_
> 1.log
  log type:  text
 opened on:  19 Aug 2022, 08:55:19

.         local today "`c(current_time)'"

.         local curdir "`c(pwd)'"

.         local newn = c(N) + 1

. 
end of do-file

. do "C:\Users\geron\AppData\Local\Temp\STD4154_000000.tmp"

. use "input/data_russia", clear

. 
end of do-file

. do "C:\Users\geron\AppData\Local\Temp\STD4154_000000.tmp"

. tab econrk

   Economic |
Rank Ladder |      Freq.     Percent        Cum.
------------+-----------------------------------
         .b |         28        0.99        0.99
          1 |        300       10.65       11.64
          2 |        404       14.34       25.98
          3 |        552       19.59       45.56
          4 |        566       20.09       65.65
          5 |        641       22.75       88.40
          6 |        155        5.50       93.90
          7 |         35        1.24       95.14
          8 |          8        0.28       95.42
          9 |          1        0.04       95.46
       five |         31        1.10       96.56
       four |         30        1.06       97.62
        one |         14        0.50       98.12
      three |         31        1.10       99.22
        two |         22        0.78      100.00
------------+-----------------------------------
      Total |      2,818      100.00

. tab powrnk

 Power Rank |
     Ladder |      Freq.     Percent        Cum.
------------+-----------------------------------
         .b |         87        3.09        3.09
          1 |        652       23.14       26.22
          2 |        462       16.39       42.62
          3 |        508       18.03       60.65
          4 |        344       12.21       72.85
          5 |        447       15.86       88.72
          6 |        122        4.33       93.04
          7 |         56        1.99       95.03
          8 |         11        0.39       95.42
          9 |          2        0.07       95.49
       five |         21        0.75       96.24
       four |         15        0.53       96.77
        one |         34        1.21       97.98
      three |         31        1.10       99.08
        two |         26        0.92      100.00
------------+-----------------------------------
      Total |      2,818      100.00

. tab resprk

    Respect |
Rank Ladder |      Freq.     Percent        Cum.
------------+-----------------------------------
         .b |        119        4.22        4.22
         .c |          5        0.18        4.40
         .d |          5        0.18        4.58
          1 |         45        1.60        6.17
          2 |         66        2.34        8.52
          3 |        127        4.51       13.02
          4 |        208        7.38       20.40
          5 |        676       23.99       44.39
          6 |        431       15.29       59.69
          7 |        499       17.71       77.40
          8 |        345       12.24       89.64
          9 |        235        8.34       97.98
       five |         31        1.10       99.08
       four |         11        0.39       99.47
        one |          2        0.07       99.54
      three |          8        0.28       99.82
        two |          5        0.18      100.00
------------+-----------------------------------
      Total |      2,818      100.00

. tab satlif

Satisfactio |
n with Life |      Freq.     Percent        Cum.
------------+-----------------------------------
          . |         28        0.99        0.99
          1 |        563       19.98       20.97
          2 |        944       33.50       54.47
          3 |        599       21.26       75.73
          4 |        418       14.83       90.56
          5 |        141        5.00       95.56
       five |          7        0.25       95.81
       four |         21        0.75       96.56
        one |         27        0.96       97.52
      three |         18        0.64       98.15
        two |         52        1.85      100.00
------------+-----------------------------------
      Total |      2,818      100.00

. tab wtchng

     Weight |
change last |
       year |      Freq.     Percent        Cum.
------------+-----------------------------------
         .b |         93        3.30        3.30
         .c |          1        0.04        3.34
         .d |          3        0.11        3.44
          1 |        667       23.67       27.11
          2 |        839       29.77       56.88
          3 |      1,069       37.93       94.82
        one |         32        1.14       95.95
      three |         65        2.31       98.26
        two |         49        1.74      100.00
------------+-----------------------------------
      Total |      2,818      100.00

. tab evalhl

     Health |
Self-Evalua |
       tion |      Freq.     Percent        Cum.
------------+-----------------------------------
          . |          5        0.18        0.18
          1 |        123        4.36        4.54
          2 |        362       12.85       17.39
          3 |      1,534       54.44       71.82
          4 |        619       21.97       93.79
          5 |         23        0.82       94.61
       five |          1        0.04       94.64
       four |         44        1.56       96.20
        one |          4        0.14       96.34
      three |         83        2.95       99.29
        two |         20        0.71      100.00
------------+-----------------------------------
      Total |      2,818      100.00

. tab operat

        Had |
  operation |
  last year |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,691       95.49       95.49
          1 |        121        4.29       99.79
        one |          6        0.21      100.00
------------+-----------------------------------
      Total |      2,818      100.00

. tab hattac

   Ever Had |
      Heart |
     Attack |      Freq.     Percent        Cum.
------------+-----------------------------------
         .b |          2        0.07        0.07
         .d |          4        0.14        0.21
          0 |      2,718       96.45       96.66
          1 |         90        3.19       99.86
        one |          4        0.14      100.00
------------+-----------------------------------
      Total |      2,818      100.00

. tab geo

 Geographic |
       Area |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        449       15.93       15.93
          2 |        593       21.04       36.98
          3 |      1,647       58.45       95.42
        one |         22        0.78       96.20
      three |         77        2.73       98.94
        two |         30        1.06      100.00
------------+-----------------------------------
      Total |      2,818      100.00

. 
end of do-file

. do "C:\Users\geron\AppData\Local\Temp\STD4154_000000.tmp"

. split hipsiz, parse("") g(hipsiz)
variables created as string: 
hipsiz1  hipsiz2  hipsiz3

. replace hipsiz = hipsiz3
(2,818 real changes made)

. replace hipsiz =  subinstr( hipsiz, ",", ".", . )
(521 real changes made)

. drop hipsiz1 hipsiz2 hipsiz3

. 
. split totexpr,  g(totexpr)
variables created as string: 
totexpr1  totexpr2  totexpr3

. replace totexpr = totexpr3
(2,818 real changes made)

. replace totexpr =  subinstr( totexpr, ",", ".", . )
(2,798 real changes made)

. drop totexpr1 totexpr2 totexpr3

. 
. replace tincm_r =  subinstr( tincm_r, ",", ".", . )
(2,752 real changes made)

. 
end of do-file

. do "C:\Users\geron\AppData\Local\Temp\STD4154_000000.tmp"

. foreach x of varlist sex econrk obese powrnk resprk satlif wtchng evalhl operat hattac smo
> kes tincm_r hipsiz totexpr geo{
  2.         replace `x' = "1" if (`x'== "one" )
  3.         replace `x' = "2" if (`x'== "two" )
  4.         replace `x' = "3" if (`x'== "three" )
  5.         replace `x' = "4" if (`x'== "four" )
  6.         replace `x' = "5" if (`x'== "five" )
  7.         replace `x' = "." if (`x'== ".b" ".c" ".d" )
  8.         replace `x' = "." if (`x'== "," )
  9.         replace `x' = "1" if (`x'== "Smokes" )
 10.         replace `x' = "0" if (`x'== "female" )
 11.         replace `x' = "1" if (`x'== "male" )
 12.         replace `x' = "0" if (`x'== "This person is not obese" )
 13.         replace `x' = "1" if (`x'== "This person is obese" )
 14. }
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1,646 real changes made)
(1,172 real changes made)
(0 real changes made)
(0 real changes made)
(14 real changes made)
(22 real changes made)
(31 real changes made)
(30 real changes made)
(31 real changes made)
(28 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(2,102 real changes made)
(513 real changes made)
(34 real changes made)
(26 real changes made)
(31 real changes made)
(15 real changes made)
(21 real changes made)
(87 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(2 real changes made)
(5 real changes made)
(8 real changes made)
(11 real changes made)
(31 real changes made)
(119 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(27 real changes made)
(52 real changes made)
(18 real changes made)
(21 real changes made)
(7 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(32 real changes made)
(49 real changes made)
(65 real changes made)
(0 real changes made)
(0 real changes made)
(93 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(4 real changes made)
(20 real changes made)
(83 real changes made)
(44 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(6 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(4 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(2 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(938 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(22 real changes made)
(30 real changes made)
(77 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
end of do-file

. do "C:\Users\geron\AppData\Local\Temp\STD4154_000000.tmp"

. ds, has(type string)
sex      satlif   monage   hosl3m   hattac   hipsiz   geo      ortho    marsta4
econrk   satecc   obese    wtchng   smokes   hhpres   work0    marsta1
powrnk   highsc   cmedin   evalhl   alclmo   totexpr  work1    marsta2
resprk   belief   hprblm   operat   waistc   tincm_r  work2    marsta3

. foreach var in `r(varlist)' {
  2.     destring `var',  replace
  3. }
sex: all characters numeric; replaced as byte
econrk: all characters numeric; replaced as byte
(28 missing values generated)
powrnk: all characters numeric; replaced as byte
(87 missing values generated)
resprk: all characters numeric; replaced as byte
(129 missing values generated)
satlif: all characters numeric; replaced as byte
(28 missing values generated)
satecc: all characters numeric; replaced as byte
(12 missing values generated)
highsc: all characters numeric; replaced as byte
(8 missing values generated)
belief: all characters numeric; replaced as byte
(38 missing values generated)
monage: all characters numeric; replaced as double
(203 missing values generated)
obese: all characters numeric; replaced as byte
(203 missing values generated)
cmedin: all characters numeric; replaced as byte
(6 missing values generated)
hprblm: all characters numeric; replaced as byte
hosl3m: all characters numeric; replaced as byte
(2 missing values generated)
wtchng: all characters numeric; replaced as byte
(97 missing values generated)
evalhl: all characters numeric; replaced as byte
(5 missing values generated)
operat: all characters numeric; replaced as byte
hattac: all characters numeric; replaced as byte
(6 missing values generated)
smokes: all characters numeric; replaced as byte
alclmo: all characters numeric; replaced as byte
(2 missing values generated)
waistc: all characters numeric; replaced as double
(21 missing values generated)
hipsiz: all characters numeric; replaced as double
(21 missing values generated)
hhpres: all characters numeric; replaced as byte
(12 missing values generated)
totexpr: all characters numeric; replaced as double
(187 missing values generated)
tincm_r: all characters numeric; replaced as double
(187 missing values generated)
geo: all characters numeric; replaced as byte
work0: all characters numeric; replaced as byte
work1: all characters numeric; replaced as byte
work2: all characters numeric; replaced as byte
ortho: all characters numeric; replaced as byte
marsta1: all characters numeric; replaced as byte
marsta2: all characters numeric; replaced as byte
marsta3: all characters numeric; replaced as byte
marsta4: all characters numeric; replaced as byte

. 
end of do-file

. do "C:\Users\geron\AppData\Local\Temp\STD4154_000000.tmp"

. ds, has(type string)

. 
. // Chequeamos unicidad de las observaciones, es decir, que no existan valores repetidos.
. isid id

. 
end of do-file

. do "C:\Users\geron\AppData\Local\Temp\STD4154_000000.tmp"

. ds, has(type numeric)
id       econrk   satecc   obese    htself   hattac   waistc   tincm_r  work2    marsta3
site     powrnk   highsc   cmedin   wtchng   smokes   hipsiz   geo      ortho    marsta4
inwgt    resprk   belief   hprblm   evalhl   alclmo   hhpres   work0    marsta1
sex      satlif   monage   hosl3m   operat   height   totexpr  work1    marsta2

. local var_miss 

. foreach var in `r(varlist)' {
  2.         mdesc `var'
  3.         if `r(percent)' > 5{
  4.                 local var_miss `var_miss' `var'
  5.         display "`var_miss'"
  6.         }
  7. }

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
             id |           0          2,818           0.00
----------------+-----------------------------------------------

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
           site |           0          2,818           0.00
----------------+-----------------------------------------------

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
          inwgt |           0          2,818           0.00
----------------+-----------------------------------------------

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
            sex |           0          2,818           0.00
----------------+-----------------------------------------------

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
         econrk |          28          2,818           0.99
----------------+-----------------------------------------------

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
         powrnk |          87          2,818           3.09
----------------+-----------------------------------------------

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
         resprk |         129          2,818           4.58
----------------+-----------------------------------------------

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
         satlif |          28          2,818           0.99
----------------+-----------------------------------------------

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
         satecc |          12          2,818           0.43
----------------+-----------------------------------------------

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
         highsc |           8          2,818           0.28
----------------+-----------------------------------------------

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
         belief |          38          2,818           1.35
----------------+-----------------------------------------------

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
         monage |         203          2,818           7.20
----------------+-----------------------------------------------
monage

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
          obese |         203          2,818           7.20
----------------+-----------------------------------------------
monage obese

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
         cmedin |           6          2,818           0.21
----------------+-----------------------------------------------

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
         hprblm |           0          2,818           0.00
----------------+-----------------------------------------------

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
         hosl3m |           2          2,818           0.07
----------------+-----------------------------------------------

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
         htself |         185          2,818           6.56
----------------+-----------------------------------------------
monage obese htself

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
         wtchng |          97          2,818           3.44
----------------+-----------------------------------------------

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
         evalhl |           5          2,818           0.18
----------------+-----------------------------------------------

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
         operat |           0          2,818           0.00
----------------+-----------------------------------------------

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
         hattac |           6          2,818           0.21
----------------+-----------------------------------------------

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
         smokes |           0          2,818           0.00
----------------+-----------------------------------------------

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
         alclmo |           2          2,818           0.07
----------------+-----------------------------------------------

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
         height |          28          2,818           0.99
----------------+-----------------------------------------------

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
         waistc |          21          2,818           0.75
----------------+-----------------------------------------------

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
         hipsiz |          21          2,818           0.75
----------------+-----------------------------------------------

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
         hhpres |          12          2,818           0.43
----------------+-----------------------------------------------

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
        totexpr |         187          2,818           6.64
----------------+-----------------------------------------------
monage obese htself totexpr

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
        tincm_r |         187          2,818           6.64
----------------+-----------------------------------------------
monage obese htself totexpr tincm_r

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
            geo |           0          2,818           0.00
----------------+-----------------------------------------------

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
          work0 |           0          2,818           0.00
----------------+-----------------------------------------------

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
          work1 |           0          2,818           0.00
----------------+-----------------------------------------------

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
          work2 |           0          2,818           0.00
----------------+-----------------------------------------------

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
          ortho |           0          2,818           0.00
----------------+-----------------------------------------------

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
        marsta1 |           0          2,818           0.00
----------------+-----------------------------------------------

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
        marsta2 |           0          2,818           0.00
----------------+-----------------------------------------------

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
        marsta3 |           0          2,818           0.00
----------------+-----------------------------------------------

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
        marsta4 |           0          2,818           0.00
----------------+-----------------------------------------------

. mdesc `var_miss'

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
         monage |         203          2,818           7.20
          obese |         203          2,818           7.20
         htself |         185          2,818           6.56
        totexpr |         187          2,818           6.64
        tincm_r |         187          2,818           6.64
----------------+-----------------------------------------------

. 
end of do-file

. do "C:\Users\geron\AppData\Local\Temp\STD4154_000000.tmp"

. ds, has(type numeric)
id       econrk   satecc   obese    htself   hattac   waistc   tincm_r  work2    marsta3
site     powrnk   highsc   cmedin   wtchng   smokes   hipsiz   geo      ortho    marsta4
inwgt    resprk   belief   hprblm   evalhl   alclmo   hhpres   work0    marsta1
sex      satlif   monage   hosl3m   operat   height   totexpr  work1    marsta2

. local varegative 

. foreach var in `r(varlist)' {
  2.         summ `var' if `var'<0
  3.         if `r(N)' > 0  {
  4.                 local varegative `varegative' `var'
  5.         }
  6. } // observamos variables numéricas con valores negativos. 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          id |          0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        site |          0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       inwgt |          0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         sex |          0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      econrk |          0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      powrnk |          0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      resprk |          0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      satlif |          0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      satecc |          0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      highsc |          0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      belief |          0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      monage |          0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       obese |          0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      cmedin |          0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      hprblm |          0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      hosl3m |          0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      htself |          0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      wtchng |          0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      evalhl |          0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      operat |          0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      hattac |          0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      smokes |          0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      alclmo |          0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      height |          0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      waistc |          0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      hipsiz |          0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      hhpres |          0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     totexpr |         62   -8452.422    8819.796  -57376.87    -232.41

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     tincm_r |          4      -183.4           0     -183.4     -183.4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         geo |          0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       work0 |          0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       work1 |          0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       work2 |          0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       ortho |          0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     marsta1 |          0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     marsta2 |          0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     marsta3 |          0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     marsta4 |          0

. // Variables con valores negativos
. summ `varegative'

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     totexpr |      2,631    7407.824     9447.94  -57376.87   128868.8
     tincm_r |      2,631     6051.82    6073.934     -183.4   113370.4

. 
end of do-file

. do "C:\Users\geron\AppData\Local\Temp\STD4154_000000.tmp"

. ds, has(type numeric)
id       econrk   satecc   obese    htself   hattac   waistc   tincm_r  work2    marsta3
site     powrnk   highsc   cmedin   wtchng   smokes   hipsiz   geo      ortho    marsta4
inwgt    resprk   belief   hprblm   evalhl   alclmo   hhpres   work0    marsta1
sex      satlif   monage   hosl3m   operat   height   totexpr  work1    marsta2

. foreach var in `varegative' {
  2.         display "Variable :===> `var'"
  3.         replace `var'=. if(`var'<0)
  4. } // reemplazamos 

. 
end of do-file

. do "C:\Users\geron\AppData\Local\Temp\STD4154_000000.tmp"

. order id site sex

. gsort -totexpr

. 
end of do-file

. do "C:\Users\geron\AppData\Local\Temp\STD4154_000000.tmp"

. foreach var of varlist sex monage satlif waistc hipsiz totexpr {
  2.         summarize `var'
  3. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         sex |      2,818    .4158978    .4929635          0          1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      monage |      2,615    556.3376    213.2852        216       1207

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      satlif |      2,790    2.483513    1.142852          1          5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      waistc |      2,797    84.62252    13.96642         29        168

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      hipsiz |      2,797    100.7892    11.96177         34        180

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     totexpr |      2,631    7407.824     9447.94  -57376.87   128868.8

. 
end of do-file

. do "C:\Users\geron\AppData\Local\Temp\STD4154_000000.tmp"

. label variable sex "Sexo"

. label variable monage "Edad en meses"

. label variable satlif "Satisfacción con la vida"

. label variable waistc "Circunferencia de la cintura"

. label variable hipsiz "Circunferencia de la cadera"

. label variable totexpr "Gasto real"

. 
end of do-file

. do "C:\Users\geron\AppData\Local\Temp\STD4154_000000.tmp"

.         twoway (kdensity hipsiz if sex==1) ||   

.         (kdensity hipsiz if sex==0), legend( label(1 "Hombre") label(2 "Mujer") )
( is not a valid command name
r(199);

end of do-file

r(199);

. do "C:\Users\geron\AppData\Local\Temp\STD4154_000000.tmp"

. #delimit ;
delimiter now ;
.         twoway (kdensity hipsiz if sex==1) ||   
>         (kdensity hipsiz if sex==0), legend( label(1 "Hombre") label(2 "Mujer") )
>         title("Distribución de la Circunferencia de la Cadera" ) 
>         ytitle("Densidad") xtitle( "" ) ;

.         graph export "output/figures/hipsiz_histogram_menvswomen.png", replace ;
(file output/figures/hipsiz_histogram_menvswomen.png written in PNG format)

. #delimit cr
delimiter now cr
. 
end of do-file

. do "C:\Users\geron\AppData\Local\Temp\STD4154_000000.tmp"

. ttest hipsiz, by(sex)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |   1,637    102.9928    .3139317    12.70163     102.377    103.6085
       1 |   1,160    97.67957     .294948    10.04557    97.10088    98.25826
---------+--------------------------------------------------------------------
combined |   2,797    100.7892    .2261775    11.96177    100.3457    101.2327
---------+--------------------------------------------------------------------
    diff |            5.313223    .4480286                4.434722    6.191723
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  11.8591
Ho: diff = 0                                     degrees of freedom =     2795

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. eststo test1: estpost ttest hipsiz, by( sex )

             |      e(b)   e(count)      e(se)       e(t)    e(df_t)     e(p_l)       e(p) 
-------------+-----------------------------------------------------------------------------
      hipsiz |  5.313223       2797   .4480286   11.85911       2795          1   1.10e-31 

             |    e(p_u)     e(N_1)    e(mu_1)     e(N_2)    e(mu_2) 
-------------+-------------------------------------------------------
      hipsiz |  5.48e-32       1637   102.9928       1160   97.67957 

. 
. #delimit ;
delimiter now ;
.         global note_nv 
>                 " \item Note: El P-value responde a la Ha: diff > 0. Siendo diff 
>                 la diferencia de medias entre mujeres y hombres.";

.     esttab test1
>             using "output/tables/ttest1.tex", replace 
>             cell(        b( pattern( 1 ) star pvalue( p_u ) fmt(4))
>                         se( pattern(1 ) par fmt(2) ) ) 
>             starlevels(\sym{*} 0.10 \sym{**} 0.05 \sym{***} 0.01)  
>             varlabels( 
>                 hipsiz "Circunferencia de la Cadera"  ) 
>             mtitle("Sample Completo") 
>             collabels( none ) 
>             prehead( "\begin{sidewaystable}[htbp] \fontsize{10}{6}\selectfont \centering \
> protect 
>                                 \captionsetup{justification=centering} 
>                                 \caption{ Test de Diferencia de Medias}
>                                 \label{ttes}
>                                 { \begin{threeparttable}\begin{tabular}{l*{1}{c}}" \toprul
> e ) 
>             posthead(\hline)
>                 postfoot(\hline \hline "\multicolumn{2}{l}{\footnotesize Errores standard 
> en parentesis.}\\" 
>                                 "\multicolumn{2}{l}{\footnotesize \sym{*} \(p<0.10\), 
>                                 \sym{**} \(p<0.05\), \sym{***} \(p<0.01\)}\\" \end{tabular
> }  
>                 \begin{tablenotes} 
>                 \begin{footnotesize} 
>                 ${note_nv} 
>                 \end{footnotesize} 
>                         "\end{tablenotes} 
>                         \end{threeparttable} 
>                         \end{sidewaystable}") ;
(output written to output/tables/ttest1.tex)

. #delimit cr
delimiter now cr
. 
end of do-file

. do "C:\Users\geron\AppData\Local\Temp\STD4154_000000.tmp"

. reg satlif  htself totexpr i.econrk i.cmedin i.work1

      Source |       SS           df       MS      Number of obs   =     2,420
-------------+----------------------------------   F(12, 2407)     =     39.04
       Model |  499.661828        12  41.6384857   Prob > F        =    0.0000
    Residual |  2567.31338     2,407  1.06660298   R-squared       =    0.1629
-------------+----------------------------------   Adj R-squared   =    0.1587
       Total |  3066.97521     2,419  1.26786904   Root MSE        =    1.0328

------------------------------------------------------------------------------
      satlif |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      htself |   .0080849   .0021965     3.68   0.000     .0037777    .0123922
     totexpr |   .0000136   2.23e-06     6.10   0.000     9.21e-06    .0000179
             |
      econrk |
          2  |   .3085921   .0836781     3.69   0.000     .1445035    .4726806
          3  |   .5026634   .0787606     6.38   0.000     .3482178    .6571089
          4  |   .8260321   .0790522    10.45   0.000     .6710147    .9810495
          5  |   1.056894   .0776452    13.61   0.000     .9046361    1.209153
          6  |   1.384828   .1103566    12.55   0.000     1.168424    1.601232
          7  |   1.245132   .1968771     6.32   0.000     .8590659    1.631198
          8  |   .9724743   .3997134     2.43   0.015     .1886564    1.756292
          9  |   2.964285   1.035665     2.86   0.004     .9333988    4.995172
             |
    1.cmedin |   .1971883    .066987     2.94   0.003     .0658301    .3285465
     1.work1 |   .2971644   .1465253     2.03   0.043     .0098356    .5844932
       _cons |   .1568338   .3763728     0.42   0.677    -.5812144     .894882
------------------------------------------------------------------------------

. est store reg1

. reg satlif  htself totexpr i.marsta3 i.econrk i.cmedin i.work1 i.ortho

      Source |       SS           df       MS      Number of obs   =     2,420
-------------+----------------------------------   F(14, 2405)     =     33.81
       Model |  504.392803        14  36.0280574   Prob > F        =    0.0000
    Residual |   2562.5824     2,405  1.06552283   R-squared       =    0.1645
-------------+----------------------------------   Adj R-squared   =    0.1596
       Total |  3066.97521     2,419  1.26786904   Root MSE        =    1.0322

------------------------------------------------------------------------------
      satlif |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      htself |   .0076308    .002206     3.46   0.001     .0033049    .0119566
     totexpr |   .0000134   2.23e-06     6.00   0.000     9.00e-06    .0000177
   1.marsta3 |  -.1143378   .0765162    -1.49   0.135    -.2643824    .0357067
             |
      econrk |
          2  |   .3070991   .0836413     3.67   0.000     .1430827    .4711156
          3  |   .4992455   .0787402     6.34   0.000     .3448398    .6536512
          4  |   .8196901   .0790695    10.37   0.000     .6646388    .9747414
          5  |   1.049782   .0776894    13.51   0.000     .8974369    1.202127
          6  |   1.378351   .1103446    12.49   0.000      1.16197    1.594731
          7  |   1.246199   .1967787     6.33   0.000     .8603253    1.632072
          8  |    .988238   .3999204     2.47   0.014     .2040138    1.772462
          9  |   2.883427   1.036292     2.78   0.005     .8513094    4.915544
             |
    1.cmedin |   .1990731   .0669591     2.97   0.003     .0677696    .3303766
     1.work1 |   .2901156   .1464939     1.98   0.048     .0028481     .577383
     1.ortho |  -.0882697    .058824    -1.50   0.134    -.2036207    .0270814
       _cons |    .321322   .3855567     0.83   0.405    -.4347357     1.07738
------------------------------------------------------------------------------

. est store reg2

. 
end of do-file

. do "C:\Users\geron\AppData\Local\Temp\STD4154_000000.tmp"

.         twoway (scatter satlif htself ), 

.         ytitle("Satisfacción con la Vida") xtitle( "Altura" ) ;
command ytitle is unrecognized
r(199);

end of do-file

r(199);

. do "C:\Users\geron\AppData\Local\Temp\STD4154_000000.tmp"

.         twoway (scatter satlif totexpr ), 

.         ytitle("Satisfacción con la Vida") xtitle( "Gastos Totales" ) ;
command ytitle is unrecognized
r(199);

end of do-file

r(199);

. do "C:\Users\geron\AppData\Local\Temp\STD4154_000000.tmp"

.         twoway (scatter satlif econrk ), 

.         ytitle("Satisfacción con la Vida") xtitle( "Escala de Rango Económico" ) ;
command ytitle is unrecognized
r(199);

end of do-file

r(199);

. clear

. exit, clear
